Public Attributes | List of all members
API_ColumnSegmentQuantity Struct Reference
Element Manager
Describes the different calculated values for column segments. More...
#include <APIdefs_Elements.h>
 Public Attributes
 double  | veneerSideSurface
surface of the column segments side veneer
 double  | veneerBottomSurface
surface of the column segments bottom veneer
 double  | veneerTopSurface
surface of the column segments top veneer
 double  | veneerGrossSurface
gross surface of the column segments veneer
 double  | veneerGrossTopSurface
gross surface of the column segments top veneer
 double  | veneerGrossBottomSurface
gross surface of the column segments bottom veneer
 double  | coreGrossSurface
gross surface of the column segments core
 double  | coreGrossTopSurface
gross surface of the column segments top core
 double  | coreGrossBottomSurface
gross surface of the column segments bottom core
 double  | grossVolume
gross volume of the column segment
 double  | coreGrossVolume
gross volume of the column segments core
 double  | veneerGrossVolume
gross volume of the column segments veneer
 double  | coreNetBottomSurface
net surface of the column segments bottom core
 double  | coreNetSurface
net surface of the column segments core
 double  | coreNetTopSurface
net surface of the column segments top core
 double  | coreVolume
volume of the column segments core
 double  | veneerNetVolume
net volume of the column segments veneer
 double  | length
length of the column segment
 double  | area
area of the column segment
 double  | volume
volume of the column segment
 double  | crossSectionAreaCutBegin
area of the column segments begin cross section
 double  | crossSectionAreaCutEnd
area of the column segments end cross section
 double  | minHeight
minimum height of the column segment
 double  | maxHeight
maximum height of the column segment
 double  | height
height of the column segment
Detailed Description
Describes the different calculated values for column segments.